import BackgroundWrapper from '@/components/ui/BackgroundWrapper'
import Badge from '@/components/ui/Badge'
import { getTranslations } from 'next-intl/server'
import ClientsSlider from './ClientsSlider'

const clientsComments = [
    {id:1, comment: "منذ بداية التعاون مع الفريق شعرنا بمدى احترافيتهم واهتمامهم بأدق التفاصيل. لم يقتصر دورهم على تنفيذ المطلوب فقط، بل قدموا لنا استشارات تقنية واقتراحات مبتكرة ساعدتنا على تحسين تجربة المستخدم بشكل كبير. النتيجة كانت منصة رقمية متكاملة، سهلة الاستخدام، وذات أداء عالي، مما انعكس مباشرة على رضا عملائنا وزيادة معدل التفاعل مع خدماتنا.", publisher: "محمد عمر– مدير تطوير الأعمال"},
    {id:2, comment: "منذ بداية التعاون مع الفريق شعرنا بمدى احترافيتهم واهتمامهم بأدق التفاصيل. لم يقتصر دورهم على تنفيذ المطلوب فقط، بل قدموا لنا استشارات تقنية واقتراحات مبتكرة ساعدتنا على تحسين تجربة المستخدم بشكل كبير. النتيجة كانت منصة رقمية متكاملة، سهلة الاستخدام، وذات أداء عالي، مما انعكس مباشرة على رضا عملائنا وزيادة معدل التفاعل مع خدماتنا.", publisher: "محمد عمر– مدير تطوير الأعمال"},
    {id:3, comment: "منذ بداية التعاون مع الفريق شعرنا بمدى احترافيتهم واهتمامهم بأدق التفاصيل. لم يقتصر دورهم على تنفيذ المطلوب فقط، بل قدموا لنا استشارات تقنية واقتراحات مبتكرة ساعدتنا على تحسين تجربة المستخدم بشكل كبير. النتيجة كانت منصة رقمية متكاملة، سهلة الاستخدام، وذات أداء عالي، مما انعكس مباشرة على رضا عملائنا وزيادة معدل التفاعل مع خدماتنا.", publisher: "محمد عمر– مدير تطوير الأعمال"},
    {id:4, comment: "منذ بداية التعاون مع الفريق شعرنا بمدى احترافيتهم واهتمامهم بأدق التفاصيل. لم يقتصر دورهم على تنفيذ المطلوب فقط، بل قدموا لنا استشارات تقنية واقتراحات مبتكرة ساعدتنا على تحسين تجربة المستخدم بشكل كبير. النتيجة كانت منصة رقمية متكاملة، سهلة الاستخدام، وذات أداء عالي، مما انعكس مباشرة على رضا عملائنا وزيادة معدل التفاعل مع خدماتنا.", publisher: "محمد عمر– مدير تطوير الأعمال"},
    {id:5, comment: "منذ بداية التعاون مع الفريق شعرنا بمدى احترافيتهم واهتمامهم بأدق التفاصيل. لم يقتصر دورهم على تنفيذ المطلوب فقط، بل قدموا لنا استشارات تقنية واقتراحات مبتكرة ساعدتنا على تحسين تجربة المستخدم بشكل كبير. النتيجة كانت منصة رقمية متكاملة، سهلة الاستخدام، وذات أداء عالي، مما انعكس مباشرة على رضا عملائنا وزيادة معدل التفاعل مع خدماتنا.", publisher: "محمد عمر– مدير تطوير الأعمال"},
    {id:6, comment: "منذ بداية التعاون مع الفريق شعرنا بمدى احترافيتهم واهتمامهم بأدق التفاصيل. لم يقتصر دورهم على تنفيذ المطلوب فقط، بل قدموا لنا استشارات تقنية واقتراحات مبتكرة ساعدتنا على تحسين تجربة المستخدم بشكل كبير. النتيجة كانت منصة رقمية متكاملة، سهلة الاستخدام، وذات أداء عالي، مما انعكس مباشرة على رضا عملائنا وزيادة معدل التفاعل مع خدماتنا.", publisher: "محمد عمر– مدير تطوير الأعمال"},
]

export default async function Clients() {
    const t = await getTranslations("HomePage.clients")
  return (
    <section >
        <BackgroundWrapper gradientStyle={{ background: "linear-gradient(to right, #354055, #6BBA74)" }} gradientOpacity="opacity-100">
            <div className="flex flex-col justify-center items-center mb-10">
                <Badge text={t("badge")} />
                <p className='font-semibold text-40 text-white mt-4 mb-2'> {t.rich("title", {
                    exe: ((chunks)=> <span className='text-green-normal'> {chunks} </span> )
                })} </p>
                <p className='text-18 text-gray-400 font-changa font-regular  min-w-75 lg:w-204.5 text-center'> {t("description")} </p>
            </div>

            <ClientsSlider items={clientsComments}/>
        </BackgroundWrapper>
    </section>
  )
}
