const blog = [
    {id: 1, badge: "تطوير البرمجيات", title: "أحدث الابتكارات والميزات لدعم نمو الأعمال عبر حلول برمجية متطورة", date: "7 أبريل 2025"},
    {id: 2, badge: "تطوير البرمجيات", title: "أحدث الابتكارات والميزات لدعم نمو الأعمال عبر حلول برمجية متطورة", date: "7 أبريل 2025"},
    {id: 3, badge: "تطوير البرمجيات", title: "أحدث الابتكارات والميزات لدعم نمو الأعمال عبر حلول برمجية متطورة", date: "7 أبريل 2025"},
    {id: 4, badge: "تطوير البرمجيات", title: "أحدث الابتكارات والميزات لدعم نمو الأعمال عبر حلول برمجية متطورة", date: "7 أبريل 2025"},
    {id: 5, badge: "تطوير البرمجيات", title: "أحدث الابتكارات والميزات لدعم نمو الأعمال عبر حلول برمجية متطورة", date: "7 أبريل 2025"},
    {id: 6, badge: "تطوير البرمجيات", title: "أحدث الابتكارات والميزات لدعم نمو الأعمال عبر حلول برمجية متطورة", date: "7 أبريل 2025"},
];

export default blog;